[
    {
        "article": "\nA man has died after collapsing in Manchester’s Central Library.Police and paramedics were called to the library, on St Peter’s Square, yesterday afternoon after the man, believed to be in his 70s, was discovered.He was taken to Manchester Royal Infirmary but was pronounced dead at on arrival. Greater Manchester Police said there were no suspicious circumstances.\n",
        "title": "Man dies after collapsing in Manchester Central Library",
        "date": "26-10-2014",
        "link": "http://www.manchestereveningnews.co.uk/news/greater-manchester-news/man-dies-after-collapsing-manchester-8000359"
    },
    {
        "article": "\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; height: auto; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\nThese spectacular panoramic pictures give you a day and night view of some of Manchester's most recognisable landmarks.The image above, taken in Piccadilly Gardens, lets you scroll around and see how the square and giant big wheel look during daylight and after dark.\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; height: auto; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\nThis interactive shot was taken outside the newly renovated Manchester Central Library.The library reopened in March after a four-year and £48m renovation.New features of the library include a new media lounge stocked with computers and gaming consoles, a specialist business library and the interactive Archives+ family and local history centre.One of Manchester's iconic Metrolink tram is also visible at the nearby St Peter's Square stop.\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; height: auto; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n These images were shot from Castlefield from over the canal.The most striking building is the iconic Beetham Tower which dominates the day skyline, and shines brightly at night.\n",
        "title": "Interactive: Spectacular panoramic night and day images of three Manchester landmarks",
        "date": "24-10-2014",
        "link": "http://www.manchestereveningnews.co.uk/news/greater-manchester-news/interactive-spectacular-panoramic-night-day-7934407"
    },
    {
        "article": "\nManchester Central Library has been crowned the city’s building of the year.It scooped the prestigious prize at the Greater Manchester Chamber of Commerce’s Property and Construction Annual Dinner last night.Held at the Hilton Deansgate, in Manchester city centre, the Library was presented the gong by Baroness Beverley Hughes.It defeated the One St Peter’s Square office development to the awaard, as well as the Manchester City Football Academy and Citylabs, one the site of the former Royal Eye Hospital.\n\n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n The Grade two listed iconic building, which is the UK’s second largest library,  is celebrating its 80th birthday this year. It was designed by E Vincent Harris and the domed structure is loosely based on the Pantheon in Rome.The building underwent a four year transformation costing £48m with the new look unveiled in March.\n\n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\nMike Gibson, Chair of the Chamber’s Property and Construction Committee, who hosted the event, said: “Manchester Central Library has been selected as this year’s Building of the Year Award winner as it is a high quality reconstruction and refurbishment of one of the city’s crown jewels.\"The attention to detail in preserving the historic character of the building is matched by the fine updating of the Library’s facilities, making it a superb asset for the inhabitants of a 21st century city.\"It’s also worth noting that the use of Building Information Modeling  in the reconstruction process has helped establish Manchester as one of the global leaders in the application of this new technology.”   \n",
        "title": "Manchester Central Library named building of the year",
        "date": "24-10-2014",
        "link": "http://www.manchestereveningnews.co.uk/business/property/manchester-central-library-named-building-7988261"
    },
    {
        "article": "\nAngry campaigners claimed Town Hall chiefs were exaggerating crime risks to justify closing a city centre street.Campaigners have slammed plans to close Library Walk, just off Mount Street, as part of Manchester Central Library’s expansion.City bosses want to gate the thoroughfare between 10pm and 6am, and said Greater Manchester Police had backed the move as it could make the area safer after dark.Because it is impossible to see from one end of the street to the other they said members of the public were exposed to attacks, after a sickening sexual assault took place in 2011. \n        Video loading                                      \n\n But dissenters from the Save Library Walk group told a public inquiry at Manchester Town hall there was no evidence the street was any more dangerous than the rest of Manchester city centre.Cross-examining David Carty, the council’s head of capital programming, one asked: “If there’s only one serious assault it must be one of the safest places in Manchester. How many are there in Piccadilly?”He added: “Where I live there have been four murders this year.”Justifying the plan to lock gates at night, the council said there had been serious public order incidents and persistent antisocial behaviour including urinating, graffiti and litter.But campaigners insisted this would drop now a new police inquiry office had opened up on nearby Lloyd Street, and more effort should be put into cleaning up Library Walk instead. \n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n Mr Carty admitted building the glass walkway between the two sites had increased the risk of crime, by creating a cul-de-sac at night, but said this only supported the move to seal the street off completely from 10pm.Dr Steve Millington, senior lecturer in human geography at Manchester Metropolitan University, said closing public space in the city centre was a step backwards.He said: “Fundamentally it’s the principle of closing down public space for some spuriously conceived risk.”He added: “If that was the case we might as well close down all pavements.”And he argued by increasing access any problems would stop because research showed well-used public spaces “police themselves”.The hearing is expected to finish today after which a planning inspector will rule whether the council can proceed.\n",
        "title": "Library Walk inquiry: Campaigners claim council is exaggerating risks of crime",
        "date": "21-10-2014",
        "link": "http://www.manchestereveningnews.co.uk/news/greater-manchester-news/library-walk-inquiry-campaigners-claim-7974809"
    },
    {
        "article": "\nManchester band Everything Everything have revealed some of the details of their week long residency at Central Library, Chaos To Order, which sees them bringing bands, theatre groups and writers to the iconic city centre building from November 10-15.Speaking exclusively to the MEN, the band’s Jeremy Pritchard told us Everything Everything will be finishing writing and recording a new album on site and that visitors can watch them at work.He said: “We’re going to be working for two hours a day in the library in a glass panelled room so you can see in like we’re zoo animals, working on songs that don’t currently exist!“And then at the end of the week, we’ll perform it. Writing an album is often about putting things in three and a half minute boxes, trimming the fat, making sure it functions as a lean animal. But we don’t have those restrictions here, so were going to be unpacking the ideas without the restrictions of songs or radio to consider.” \n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n Joining the band at the newly refurbished library will be BBC 6 Music’s Mark Radcliffe and Stuart Maconie, who will broadcast their radio show live from the venue on November 14 with special guests Guy Garvey, of Elbow, and New Order’s Bernard Sumner.Former MEN reporter and now critically acclaimed novelist Emma Jane Unsworth will be writer in residence, hosting daily readings of Frank O’Hara’s Lunch Poems, plus discussions and workshops with contemporary writers.Utilising the 1930s Henry Wolfson Reading Room, with its distinctive glass dome ceiling, was key for the band and theatre group Quarantine will present a mass spoken-word choir right under the dome on November 14.Jeremy says the idea was to use all the spaces, including the new glass elevators where Dumblove Encounters will perform one minute long plays in the lift for anyone who gets in.Jeremy adds: “We’ve been working on this since April or May, and one of the things that attracted us to curating it was there was no remit. They wanted us to use the building in whatever way we saw fit.“As much as we can we are using spaces not associated with the normal library use: the lifts, the stairwells, the coffee area. We’re trying to design it so that people will encounter things - some of it will be ticketed, but a lot of it will just happen to you!”\n",
        "title": "Everything Everything reveal plans for Central Library takeover",
        "date": "07-10-2014",
        "link": "http://www.manchestereveningnews.co.uk/whats-on/music-nightlife-news/everything-everything-reveal-plans-central-7895578"
    },
    {
        "article": "\nThe new chairman of pro.manchester has set a target of growing the membership body's revenues to £1m.\nJohn Jones made the declaration his his Chairman's Reception last night.\npro.manchester, which represents financial and professional services in the city, has developed a series of sector groups over the past year, to align itself with Greater Manchester's key growth priorities.\nIt has also recently re-aligned its business to include corporate membership enabling businesses outside of the financial and professional services industry to engage with its member firms.\n\n\n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n  \nMr Jones, who is partner at Manchester accountants and business advisors Beever and Struthers also announced a range of new developments and initiatives,  including further expansion to The SME Club.\nBacked by the M.E.N, it has seen its members increase to 20,000 in the past year.\nA two day conference ‘The Big Social Media’ Conference will take place on the 9th July next year and will be delivered by Social Media Experts, the online community providing social media expertise. The conference which will boast some of the biggest names and brands in social media including Mari Smith, Relationship Marketing expert and Facebook Guru, will be held at The Point, Lancashire County Cricket Club.\nThere was also positive news for charity event Can You Sing Manchester which is seeking to raise £50,000 for Macmillan Cancer and Francis House Trust, as Chairman John Jones announced the fundraising had reached over £19,000.\nMr Jones said: \"pro.manchester has developed into a sophisticated business to business model and our key success factors are our members, our high quality events and unrivalled business development opportunities. pro.manchester will firmly remain in the heart of the financial and professional services sector but with a greater commitment than ever before to linking our members to other sectors and a whole range of beneficial partners through our increased business development activity.\n\"pro-manchester will return to profit in the coming year and revenue growth will increase significantly as we commercialise areas of our programme such as Sector Groups, I am confident within two years this organisation will reach it’s £1m turnover target.”\nChief Executive John Ashcroft said: \"pro.manchester is heading in a great direction; we are in a fantastic position of remaining committed to our core membership and offering whilst being able to offer new and exciting business development opportunities.\n\"Our Sector group programme offers so much opportunity for businesses to position themselves as industry specialists whilst the growth of products like The SME Club and the addition of key flagship events like The Big Social Media Conference allow us to become a successful revenue generating business ensuring we are able to continue to develop and expand our programme for the benefit of our members and the Manchester business community.\"\nThe pro.manchester Chairman’s Reception was held at Manchester Central Library and was sponsored by Beever and Struthers.\n",
        "title": "Pictures: pro.manchester Chairman's Reception",
        "date": "12-09-2014",
        "link": "http://www.manchestereveningnews.co.uk/business/pictures-promanchester-chairmans-reception-7763125"
    },
    {
        "article": "\nWork on the controversial Library Walk link is almost complete - but gates and doors cannot be installed because Manchester council has not got official permission to block the way.Construction of the £3.5m glass extension began two years ago, with the walkway between the Town Hall and Central Library revealed this week.The glass structure is now nearly finished but the automatic glass doors, closed from 10pm - 7am, and a gate at Mount Street, can't be installed until permission is granted.\n\n        Video loading                                      \n\n The council had the go-ahead for the glass extension but started work without an official ‘stopping up’ order.A government inquiry is due to be held in October to determine if the historic path between the two buildings can be blocked.Campaigners against the Library Walk extension then contacted the Government’s Planning Inspectorate - which will hold a two day inquiry into the matter at the Town Hall on October 21 and 22.If the Inspectorate finds against the council the gates will not be installed and the automatic doors will be left open 24 hours a day.\n\n\nCentral Library after undergoing a multi-million pound refurbishment\n\n\nMorag Rose, from the Friends of Library Walk group, said: “We’re very pleased to have got an inquiry because we don’t believe the council followed due process in blocking a right of way.\"There’s a real feeling that they have not listened to people on this.“The cost is disgraceful and the money could be much better spent elsewhere.“In time we believe it will prove to be a complete folly.”\n\n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n The council says the extension is necessary for security, easing congestion at Town Hall and Central Library entrances and will encourage people to access more services by clearly linking the two buildings.Without it people would have to go back outside or through a basement route.Council leader Sir Richard Leese said: “We believe the link maintains the distinctive curve of Library Walk while complementing the historic buildings it will connect – transforming an underused shortcut, which many felt was unsafe outside peak times, in to a welcoming walkway, public space and a clear and visible entrance to the complex.“These plans will promote access to Library Walk rather than inhibiting it as it will be a much friendlier place to be.”\n",
        "title": "Pictured: Work is almost complete on new-look Library Walk",
        "date": "11-09-2014",
        "link": "http://www.manchestereveningnews.co.uk/news/greater-manchester-news/pictured-work-complete-new-look-library-7750438"
    },
    {
        "article": "\n \n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\nManchester band Everything Everything will bring six days of music and art to the city’s Central Library in November to celebrate its £48m renovation.Artists, authors, comedians, dance troupes and theatre groups will be performing in cultural festival Choas To Order, produced by Brighter Sound, from November 10 to November 15.Several new commissions will be premiered, all created in response to the library, its architecture, and the people who use it.So far, the band has announced appearances from comedian Josie Long, former MEN journalist and author Emma Jane Unsworth, musicians Josephine Oniyama and Kiran Leonard, BBC6 Music DJ Shaun Keaveny, composers Christophe de Bézenac and Matt Bourne, and theatre groups Dumblove Encounters and Company Chameleon.Young Manchester bands will also be invited to perform, and more names are due to be announced over the coming weeks.“The festival will collaborate, explore and experiment to test the limits of what a 21st-century library can be, taking inspiration from Central Library's unique architecture and commissioning original pieces which involve, respond to, and interact with the library-going public,” say the band about the festival.Central Library’s renovation is part of a £155m three year transformation of civic buildings on St Peter’s Square, including the neighbouring town hall extention.\n",
        "title": "Manchester band Everything Everything programme five days of culture at Central Library",
        "date": "06-09-2014",
        "link": "http://www.manchestereveningnews.co.uk/whats-on/manchester-band-everything-everything-programme-7721015"
    },
    {
        "article": "\nFamous faces will be giving a voice to iconic Manchester statues as passers-by get the chance to hear from the likes of Queen Victoria, Abraham Lincoln and LS Lowry.Corrie legend David Neilson, who plays Roy Cropper, and Fawlty Towers actress Prunella Scales are among the stars giving the city’s statues the chance to speak their minds.From tomorrow, curious onlookers will be able to swipe their smartphones over plaques on seven of the city’s statues, before receiving a ‘call back’ from their historical figure of choice.‘Talking Statues’ in Manchester include Alan Turing in Sackville Gardens, played by Russell Tovey in a monologue penned by Mark Ravenhill, and famous conductor Sir John Barbirolli at the Bridgewater Hall, voiced by celebrated actor Timothy West.Hear from David and see how Talking Statues works in the video below ...\n\n        Video loading                                      \n\n Visitors can also find out what Abraham Lincoln is doing in the city’s Lincoln Square, and just why the area is named after him, in a piece written by journalist and author Gary Younge.Meanwhile, The Reading Girl in Manchester Central Library has been given voice by Jenna Louise Coleman performing words by acclaimed children’s author Jacqueline Wilson.Prunella Scales takes a majestic role as Queen Victoria in Piccadilly Gardens in a monologue written by Katrina Hendry, which Scales says she hopes will help people ‘regard her in a new light’.And LS Lowry is still propping up the bar at Sam’s Chophouse, his favourite watering hole. The painter is brought to life by David Neilson in a piece based on Lowry’s own words, written by Kiran Benawra.The voices on the statues are activated by scanning QR codes through your smartphone.David Neilson said Lowry is not only an iconic character for Manchester, ‘but for the working man’.“I work just across the way from the Lowry Centre and can see how people valued, still value, his art,” he said.“He’s nicely odd, he’s nicely northern – maybe I relate to that! And he’s a got a bit of swagger too.”One final Manchester statue awaits the gift of speech – the T-Rex skeleton in Manchester Museum will be a late talker with his monologue written through a public competition.The winning piece will be chosen in November, recorded by a celebrity and included as part of Talking Statues Manchester.Would-be writers can find out more by visiting www.talkingstatues.co.uk.\n",
        "title": "Watch: Manchester's statues are given a voice by famous faces - using your smartphone",
        "date": "18-08-2014",
        "link": "http://www.manchestereveningnews.co.uk/whats-on/watch-manchesters-statues-given-voice-7631222"
    },
    {
        "article": "\nThe shortlist for this year’s Building of the Year Award has been revealed.Greater Manchester Chamber of Commerce judges said one of the following four buildings will scoop the prize.·         Manchester Central Library Redevelopment·         Citylabs ·         One St Peter’s Square, Manchester·         Manchester City Football Club Academy and Training CentreIt follows Rochdale's Number One Riverside building winning last year.The building, now home to Rochdale council, impressed judges with its stunning design, high sustainability credentials, quality of build and its contribution to the regeneration of Rochdale town centre.\n\n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n Mike Gibson, Chair of the Chamber’s Property and Construction Committee, said the award is now in its tenth year.“This competition celebrates the new and innovative buildings that are constructed in our region each year, and showcases the successful collaborations that take place between talented project teams in our industry and their clients,\" he said.\"Again we invited nominations from everyone in our sector and received many worthy entries from across Greater Manchester.\"Without doubt, the final four buildings all make a significant contribution to our city region in terms of construction and development and I look forward to the judging process.”Previous winners of the competition have included The Space Youth Intervention Centre for 42nd Street in Manchester, MediaCity UK and the People's History Museum.The judging committee, which consists of 15 professionals from a range of businesses in the property and construction sector, will be undertaking site visits over the next few weeks before making its final decision.The winning building will be announced at the Chamber’s Property and Construction Annual Dinner at The Hilton Deansgate in Manchester on October 23 - and pick up a £1,000 prize.The Apprentice of the Year award will also be presented on the night.\n",
        "title": "Finalists of Greater Manchester Building of the Year Award named",
        "date": "07-08-2014",
        "link": "http://www.manchestereveningnews.co.uk/business/finalists-greater-manchester-building-year-7570726"
    },
    {
        "article": "\nSome of the most energising jazz arises from a workshop environment where a guiding force helps all the personalities put their stamp on a common purpose.And so it was with Manchester-bred Anton Hunter's Article XI,  performed in the impressive setting of the revamped central library.The project, generously supported by MJF sponsor Irwin Mitchell solicitors, involved a band of 11, led by rising star Anton.Each musician recorded an interpretation of a basic motif suggested to them by Anton.The combined efforts were then honed into a selection of interchangeable pieces and then rehearsed briefly.Results panned out beautifully into a suite of eight arrangements.Drummer John Hunter and bassist Eero Tikkanen set out swinging, fluid structures over which the horns set out their loose-limbed lines.Eero's playing was a revelation to me all night; fresh and natural without the slightest hint of cliché. The first piece  had Eero's lone bass appearing half-way only to be overtaken by scrabbling saxes and then all the horns playing a swaggering anthem.  \n\n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n           \"It was a great event and a good example of arts patronage at its best\"Anton stepped back for the majority of the evening, acting as conductor, adding judicious comping throughout and a measured solo on the second piece.Mette Rasmussen excelled during her furious alto workout with drums and bass on the third piece.On the fourth piece, entitled C# Makes the World A Better Place, Anton set up quiet, synth-like strains with a slide on his fretboard. The throbbing saxes lurked about until a final enthralling chant from the horns.The fifth piece was my favourite. A dramatic, somber but ever-so softly swinging theme, reminiscent of Ellington/Strayhorn, gave way to trumpeter Graham South's breathtaking solo, full of poise and invention. It was followed by the equally impressive trombonist Seth Bennett and a team finish in which everyone sounded just right.The very final piece segued into a driving beat with an impressive statement from trombonist Richard Foote.A climatic final anthem was pounded home with decorative lines added by the horns.It was a great event and a good example of arts patronage at its best.To hear the fifth piece online, albeit without the benefit of mastering go hereThe musicians were:Anton Hunter / guitar, electronicsGraham South, Nick Walters / trumpetsMette Rasmussen / alto saxophoneSam Andreae, Simon Prince / tenor saxophonesCath Roberts / baritone saxophoneSeth Bennett, Richard Foote / trombonesEero Tikkanen / bassJohnny Hunter / drums\n",
        "title": "Manchester Jazz Festival Review: Anton Hunter's Article XI at Central Library",
        "date": "25-07-2014",
        "link": "http://www.manchestereveningnews.co.uk/whats-on/manchester-jazz-festival-review-anton-7507303"
    },
    {
        "article": "\nA new business centre in the heart of Manchester is hoping to become a one stop shop for local entrepreneurs looking for support.The Business and intellectual property  Centre at Manchester Central Library is helping local entrepreneurs in their journey to start and launch their own enterprise while learning the skills they need to grow their firm.Based on the British Library’s own Business and IP Centre in London, it will provide a dedicated space for both aspiring and established entrepreneurs in the area to access the libraries’ valuable collections such as market research, company and financial information, and patent and trademark specifications, spanning both the UK and global markets.Access to these core library collections such as Mintel UK, Datamonitor, and Creditsafe, are typically not affordable for small businesses.They will be complemented by a face-to-face service, including workshops, networking events, and one-to-one advice and coaching sessions from business experts on how to protect their ideas, grow their businesses, and become commercially successful.Events currently running at the library include Start Up Advice by north west business support service, Blue Orchid, Digital Growth Drop In, Manchester Inventor’s Group, Growth Start Up Advice by the Business Growth Hub, IP Clinic, which offers free advice on IP including trademarks, design and copyright, as well as the Explore Enterprise programme, which is aimed at 18 to 30 year-old, and is offered by the The Prince’s Trust.Other social events include the Inspiring Entrepreneurs, which invites local successful entrepreneurs to talk about their success stories.Manchester is one of six cities which has been taking part in a pilot scheme over the past 18 months.\n\n\nRussell Clifton at Ruk-Bug\n\n\n Businesses are already taking advantage of the service including Manchester inventor Russell Clifton, who is behind the Rukbug, a child’s pushchair that converts into a rucksack.Russell did all his research at the library, attended the patent clinics and used the business library resources to help him develop his firm.He was recently made innovator in residence at the Library, and will be offering his advice to other would-be inventors.Jonathan Ebbs, service development manager for information and digital, said: “For many years we have recognised the value of local business and start-ups not just to the local community but the local economy, so we’re very excited to take our services to the next level by being able to provide a comprehensive service to entrepreneurs in the region.“It’s a place for inspiration and a place to learn how to grow a business, and access the right support from our partner agencies such as the Business Growth Hub.“But it’s not just about accessing information at the library, but also about meeting other entrepreneurs.“If you’re a start-up working on your own, it can be lonely sometimes.“Here we want to encourage people to meet like minded individuals, make new connections and network.“We have meeting spaces for people to use for free if they want to meet clients for example.“Not everyone has a city centre location so this has been a valuable space for a lot of young businesses, especially if they want to keep their overheads down.”\n\n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n Isabel Oswell, head of Business Audiences at the British Library, said: “The first Business & IP Centre outside London opened in Newcastle City Library just over a year ago, and since that time it has helped over 1,200 local businesses.“With the volume of UK SMEs growing all the time, it’s more important than ever to offer businesses free and trusted business and intellectual property information and advice, and we’re thrilled that from this week Manchester and Birmingham will now be offering this service to entrepreneurs in their city regions.“We urge anyone with a business idea within easy reach of either of these iconic libraries to go there and get started.”The British Library’s vision is to create a National Network of Business & IP Centres across the UK offering a free, trusted and valuable service for the nation’s entrepreneurs, so that anyone starting or running a business has a central place to go, in their local area, for support, inspiration and information.\n",
        "title": "Book yourself in for advice on launching an enterprise",
        "date": "22-07-2014",
        "link": "http://www.manchestereveningnews.co.uk/business/smes/new-firms-book-advice-manchester-7477554"
    },
    {
        "article": "\nManchester's Central Library has turned a new page in its history - to mark its 80th birthday.Schoolchildren from Our Lady’s Primary in Blackley were among those to celebrate eight decades of literary heritage at a special party yesterday.The library was opened by King George V and Queen Mary on July 17, 1934, quickly becoming one of Manchester’s best loved buildings.Among the exhibits on display at the birthday celebrations were the original visitor’s book from that day, featuring not only the king’s signature but also that of Winston Churchill some years later.Culture vultures had the opportunity to browse through original archives from the period, including newspaper clippings from the M.E.N. marking the opening. \n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n But the library looked to the future yesterday too, launching the Get Digital event - showcasing some of the high-tech facilities now on offer.Digital music suites, gaming consoles, 170 computers and free wi-fi have all been available since the library reopened following a £50m refurbishment earlier this year.Since then more than 300,000 books have issued, according to the council.See the library through the years with our gallery:  \n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n \n",
        "title": "Pictured: Children help Manchester Library celebrate 80th birthday",
        "date": "17-07-2014",
        "link": "http://www.manchestereveningnews.co.uk/news/greater-manchester-news/manchester-central-reference-library-children-7448840"
    },
    {
        "article": "\nManchester’s statue of Queen Victoria is to be given a voice by a legend of British TV – as part of a star-studded arts project.Fawlty Towers actress Prunella Scales is helping bring the Piccadilly Gardens monument to life as part of the interactive Talking Statues Speak Their Minds initiative.People will be able to swipe their smartphones next to statues across Manchester to receive a ‘call’ from the figure – in which they speak of their achievements or pass on their musings on life.Writer Dame Jacqueline Wilson, author of the Tracy Beaker books, has taken part in the project, and has been asked to pen the thoughts of a statue at Manchester Central Library called The Reading Girl, with a narrator recording the words.The marble figure is the work of 19th century sculptor Giovanni Ciniselli and Wilson imagines the girl plotting her return to Rome - escaping the ‘coldest, rainiest place on the planet’.Some 35 public statues across Manchester and London have been chosen for the project, which launches next month.It has been devised by non-profit arts organisation Sing London and aims to connect people to their surroundings in an entertaining and educational way.Coun Pat Karney, Manchester council’s city centre spokesman, said: “Bringing these statues back to life in this innovative way will make people curious about why they are there in the first place.“For many young people, these statues don’t mean anything and you have to be modern and original if you want to engage them. This project does just that.“And when there’s a statue of me and Richard Leese – kind of like Morecambe and Wise – Mancunians will be able to put nice words in our mouths.”In London, Prunella Scales has provided a monologue for the Queen Victoria statue on Blackfriars Bridge – while Sir Patrick Stewart will regale passengers at Paddington train station with the story of the Unknown Soldier.People can swipe their smartphones on plaques near the statues, scan a code or visit a web address. In each case, a soundfile will be downloaded to the device, giving the impression the phone is ringing. When the ‘call’ is answered, the figure’s monologue begins. The project, to run for a year, has been paid for by Nesta, a charitable trust funded by the National Lottery.More news from the Manchester Evening NewsFind out what's happening where you live with our In Your Area sectionRead the Manchester Evening News on your phone - download the Apple MEN App here, the Android MEN App here - and get the paper as an e-edition every morning  by subscribing here\n",
        "title": "Statue that speaks the Queen's English: Victoria statue brought to life in star-studded arts project",
        "date": "06-07-2014",
        "link": "http://www.manchestereveningnews.co.uk/whats-on/arts-culture-news/piccadilly-gardens-queen-victoria-statue-7379605"
    },
    {
        "article": "\nDig the City: There are plenty of ways for kids to join in the fun at the city’s annual urban gardening festival. In St Ann’s Square, they can make mud pies and grass trumpets in the National Trust’s treehouse and build their own birdhouse with Construction Youth in St Ann’s Square, while over on King Street they can play giant garden games like croquet and space hopper races. Children can also follow a trail around the Arndale Centre, collecting free stamps from shops to claim a unique prize at the end. Saturday August 2 to 10, various locations. All ages. Free. Full event programme at digthecity.co.uk.Victoria Baths open days: Explore Manchester’s water palace and find out more about the old Edwardian swimming pool and Turkish baths’ past, present and future with fascinating history displays and guided tours. Visitors will get to learn all about its amazing architecture, hear bathers’ memories and find out how they can get involved with helping to preserve this treasure for generations to come, while kDids can have a go at the Soapy Sami treasure trail. On Sunday 6 July there will also be a 50-stall art and craft fair while on Sunday 3 August there will be summer tea dance featuring a choir performance from Music on the Move. Sunday 6 July and Sunday 3 August noon to 5pm. All ages. Entry £2.50/3 adults, under-16s and Friends of Victoria Baths free. Tours take place at 12.30pm, 1pm, 2pm and 2.30pm and cost £3/3.50.\n\n\nDays out guide: Manchester. Victoria Baths open day\n\n\n Festival of Model Tramways: The popular family event is returning to the Museum of Transport for its 26th year. Kids are sure to be wowed by vast array of model tramway layouts and displays and, if they’re feeling inspired, there will be plenty of stalls selling all the necessary kit for them to have a go at building their own. Saturday 19 and Sunday 20 July, 10am to 5pm. Museum of Transport, Boyle Street, Cheetham Hill. All ages. Admission £7.50, concessions £6.50. Under-16s free.Mini Maker Fair: Hobbyists, inventors, hackers and crafters of all ages and abilities will be united at this hands-on, family-friendly event at the Museum of Science and Industry. From tech geeks to total beginners, everyone can try something new with workshops, demonstrations and talks on everything from soldering to coding, stitching and graphic design. Saturday July 26 to Sunday July 27, 10am to 5pm. MOSI, Liverpool Road, Castlefield. All ages. Free.Screenfields: Pull up a deckchair and enjoy a family film outing at Spinningfields’ al fresco cinema. Showing classics most Thursday nights come rain or shine, screenings include Stand By Me on July 24 . Cinema-goers can enjoy snack on tasty street food from Mumma Schnitzel and sip healthy smoothies from Wholesome and Raw while the grown-ups in the audience can unwind with drinks from the Long Bar and the Lawn Club. Thursdays throughout July and August, 7pm. The Lawns, Spinningfields. Entry £3.\n\n\nDays out guide: Manchester. Screenfields.\n\n\n Musical Mobiles: Be inspired by the vinyl records in the People’s History Museum’s jukebox to create your own hanging mobile and explore the attraction’s Time Off? Displays to find out more about the part music has played in working people’s lives over the decades. Over-5s. Wednesday 20 August, 1pm to 3pm. People’s History Museum, Left Bank, Spinningfields (0161 838 9190). Free, suggested donation £3. Booking required at musical-mobiles.eventbrite.co.uk.Dinosaur Zoo: Prehistoric puppetry will bring dinosaurs to life as this interactive and imaginative live show roars into the Palace Theatre. The West End and worldwide hit introduces audience members to a range of critters, from cute baby dinos to teeth-gnashing giants – and if you’re brave enough, you might get invited on stage to help out with the zoo keeper’s daily tasks. But be warned – not all of these ravenous reptiles are as tame as they seem. Suitable for over-threes. Palace Theatre, Oxford Road (0844 871 3019). Friday 18 July to Saturday 26 July. Performance times vary. Tickets £13.50-17.90.Crocodile Joe’s Wild World: The children’s TV star and conservationist will be bringing his rescued reptiles to Manchester Airport’s Runway Visitor Park for a series of education and handling shows throughout the summer holidays. Visitors can get up close and personal with snakes, geckos, skinks and other exotic animals, learn about welfare and conservation and discover the far-flung places the creatures can be found in the wild. Kids will also get to take part in an exciting treasure hunt. Manchester Airport Runway Visitor Park (0161 489 3932). Sunday 13 and Saturday 26 July; Sunday 10, Saturday 16, Sunday 24 and Saturday 30 August. Four shows each day. All ages. Free, tickets must be booked on arrival.The Color Run: The messy 5k fun run returns to Manchester in an explosion of colour. Runners cross the starting line dressed in white and finish covered from head to toe in every shade of the rainbow as they are doused with powder paints at each kilometre marker. The party continues at the finish line with a festival of colour featuring a live DJ, top tunes – and more paint. All ages and abilities are welcome and, with no winners or official times, the emphasis is all on finishing with a smile and creating happy memories. Etihad Stadium, Clayton. Saturday 5 July, 11am-3pm. Entry £29.99, children under five go free.Caribbean Carnival of Manchester: Join around 25,000 people as Manchester’s Caribbean community celebrates its culture, music and food in this vibrant, two-day festival. Watch as the colourful parade winds its way from Alexandra Park to Platt Fields through the streets of Moss Side and Hulme, with its flamboyantly-decorated floats pumping out soca and calypso music and carrying steel pan bands and dance troupes. At Platt Fields there will be more music and merriment, including a samba band, Caribbean food stalls, poetry, face painting, a fun fair and much more. Platt Fields park, off Wilmslow Road, Fallowfield. Saturday 19 and Sunday 20 July, parade begins at 1pm on Saturday. www.themanchestercarnival.com\n\n\nPaul Heyes\n\n\nColourful: Manchester Caribbean Carnival drummers\n\n\n Holly Webb’s Animal Stories: The best-selling children’s author will be talking about her hugely popular Animal Stories series. The collection, which includes Lost in the Snow, Alfie All Alone, Ellie the Homesick Puppy and Oscar’s Lonely Christmas, has sold more than a million copies. She will also be signing books for fans. Suitable for primary school age children. Manchester Central Library, St Peter’s Square, city centre (0161 234 1983). Saturday 5 July, 2-3pm. Free, places limited. Call, drop in or email libraries@manchester.gov.uk to book. NEEDS PIC.The Tongue-Twister: A darkly comic play about a boy who arrives in a new town where rhyming is forbidden and folklore has it that anyone caught defying the rules will be punished with a visit from the Tongue Twister. Then silent sweet shop owner Old Timer gives him a special red lolly that makes him rhyme all the time. This family-friendly show is part of the 24:7 Theatre Festival, now in its 10th year. The Basement, New Century House, Corporation Street, city centre. Friday 18 July to Friday 25 July (excluding Wednesday 23 July). Performances at 2pm except Saturday 19 July (11am). All ages welcome, recommended for ages seven and up. £8 adult, £6 concessions, £23 family ticket.A Celebration of Star Wars: The Printworks is transporting visitors to a galaxy far, far away as it hosts a Star Wars themed day. The event includes the chance to meet Darth Vader, Storm Troopers, C-3PO, R2-D2 and lots more characters, plus signings with stars of the film series, exhibitions, cosplay competitions, live music, merchandise stalls and much more. The Printworks, Withy Grove, city centre. Sunday 6 July, 12-6pm. All ages. Free.\n\n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n MCM Manchester Comic Con: Graphic novel fans are in for a treat as the event comes back bigger and better than ever for a two-day show at Manchester Central. Billed as ‘a weekend of geeky fun’, visitors can expect to meet talented artists, writers and special guests, try out some of the newest games and marvel at the costumes on display in the cosplay masquerade. They can also cheer on the battling ‘bots from BBC classic Robot Wars, chill out in the retro gaming zone and check out a host of retailers selling everything from replica lightsabres to the latest anime. Manchester Central convention centre, Windmill Street, city centre. Saturday 19 July, 11am-6pm, and Sunday 20 July, 11am-5pm. Adults (15 and over) £8, children £6, under-10s free. Www.mcmcomiccon.com.All the Lawn’s a Stage: Following on from the success of its outdoor film screenings, Spinningfields will stage its first ever open air Shakespeare productions this summer in honour of the 450th anniversary of the Bard’s birth. GB Theatre Company will perform two of the playwright’s greatest works, Macbeth and A Comedy of Errors, in front of an audience of up to 400. The cast for includes Joyce Branagh – sister of Kenneth – as Lady McBeth alongside Mia Keadell, Aonghus Weber and Jenny Johns, who will perform in traditional costume with little to no set. Friday 18 July to Sunday 20 July, 7.30pm and 2.30pm matinee. The Lawns, Spinningfields. Adults £18, under-16s and OAPs £14.Manchester Children’s Book Festival: Catch the last-two days of this week-long celebration of kids’ fiction, giving little bookworms the chance to meet their literary superheroes and express their own creativity. Events include a puppetry session inspired by acclaimed play War Horse, performances and workshops based on The Diary of Anne Frank, a vintage afternoon tea with young adult fiction author Cathy Cassidy and a musical afternoon tea with the festival’s creative director and Poet Laureate Carol Ann Duffy and actor and musician John Sampson. Venues, age suitability and prices vary. For a full programme at of events and to book tickets click here, or call 0843 208 0500.Aviation and Transport Festival: Featuring a Spitfire and Battle of Britain Memorial Flight flyover, Concorde tours, aircraft cockpit diplays and a fly-in and static display of vintage aircraft, this event promises to be a plane-spotter’s paradise. There will also be more than 200 vintage, classic and high performance cars, plus hot air balloons and model railway, boat, truck and aircraft displays. If that isn’t enough to keep the little ones entertained, there will also be face-painting, a bouncy castle and an appearance from Fergus the tractor as well as a craft fair and music. Manchester Airport Runway Visitor Park, Sunbank Lane. Saturday 5 and Sunday 6 July, 10am-5pm. Adults £6, under-12s £3, under-fives free.\n\n\nDays out guide: Manchester. The airport's Runway Visitor Park will host an Aviation and Transport Festival\n\n\n Wythenshawe Games: Get outdoors and join in the fun at this week-long community sports festival. There is a daily under-fives zone with fun and games for young families from 11am to 2pm, and at 4pm the games village is transformed into a youth zone with activities geared towards 11 to 19-year-olds. Real Food Wythenshawe will be on hand all week offering tips on growing your own food and cooking quick, healthy meals on a budget. Wythenshawe Park. Saturday 26 July to Friday August 1. All ages, free.Around the World in 80 Days: Join eccentric Phileas Fogg as he attempts to circumnavigate the globe with his travelling companion Passepartout. A cast of eight will transport audience members around the world via 108 characters, 33 scenes, six boats, five trains, three fights and a circus, together with wonderfully funny feats of imagination. An incredible tale of adventure for all the family. The Royal Exchange, St Ann’s Square, city centre (0161 833 9833/royalexchange.co.uk). Thursday 17 July to Saturday 16 August. Performance times vary. Tickets from £14.50, half-price previews from £7.25 and banquette tickets £10.Summer World Records Extravaganza at Manchester Museum: Little explorers can travel the world this summer without leaving Manchester, both back in time and across the globe enjoying the amazing and varied collections at Manchester Museum. Discover record breaking objects from the largest giant spider crab to the smallest pea crab. And you can even set some records of your own. Manchester Museum, Oxford Road (0161 275 2634/manchester.ac.uk/museum) Monday 21 July to Sunday 31 August, 11am-4pm. All ages. Free.\nFamily days out: Bury \n",
        "title": "Family Days Out: Manchester",
        "date": "03-07-2014",
        "link": "http://www.manchestereveningnews.co.uk/whats-on/whats-on-news/family-days-out-manchester-7307620"
    },
    {
        "article": "\nEventsFilmed Up – June 2014:  Discover the great range of short films being produced by our region’s filmmakers at Filmed Up, Cornerhouse’s regular short film night. Expect an eclectic mix of genres and styles in the programme, which has been selected by the toughest critics of all – a panel of Cornerhouse audience members.Friday 13 June, 6.30pm. Cornerhouse, Oxford Street . Suggested donation, £5.\n\n\nVal McDermid\n\n\nThe Theakstons Old Peculiar Crime Writing Festival Tour – Book Event:  The annual Harrogate crime writing festival comes to Manchester to reach into all our crime-ridden imaginations. Festival writer-in-residence David Mark will be leading a discussion on this year’s Big Read, the iconic ‘A Place of Execution’, penned by crime writing legend and Manchester resident Val McDermid.Friday 13 June, 2pm-3pm. Manchester Central Library, St Peter’s Square. Free, confirm your place by calling 0161 234 1056.Creator Industria – Barnaby Festival Weekend:  As Macclesfield’s Barnaby Festival kicks off this weekend, those generous folks at Incubation Arts are offering the chance for visitors to make their own creative contribution via a series of workshops and activity events. Practise your drawing skills with artist Jeff Teasdale (Saturday 14 June, 11am), develop your creative writing talents with Rosemary Graham (Saturday 14 June, 12pm), try your hand at mono printing (Sunday 15 June, 2pm), and much, much more. Saturday 14 June to Sunday 29 June, Charles Roe House, Chestergate, Macclesfield. Free. Click here for a full events programme .Carnivalising Pop: Music Festival Cultures:  To mark the start of the festival season, Create Salford is hosting this international symposium to discuss and explore the significance of the popular music festival. Guest speakers include author and academic Dr Gina Arnold and photographer and festival activist Alan Lodge who will be discussing his classic images from 1970s festivals and the 1980s/1990s free party scene.Friday 13 June, 9.30am-6pm. The Old Fire Station, The Crescent, Salford. Free, advance booking required. ClubbingEastern Bloc:  Kevin McAuley, one third of Hessle Audio, is in for a three-hour set, performing under his Pangaea moniker. He will be joined by EB residents Means&3rd and Radley.Friday 13 June, 11pm-4am. Soup Kitchen, Spear Street (0161 236 5100). Tickets £6/£8. Pulse: This is a brand new trance night, dedicated to re-connecting the genre with the masses and showcasing new and legendary talent.Friday 13 June, 10pm-4am. 1 Primrose Street, Primrose Street, Ancoats (07958 048872). £7.\n\n\nCommon\n\n\nFriends in Common:  The popular weekly bar session is back, with this time’s friend being none other than Hoya:Hoya’s Jonny Dub.           Friday 13 June, 9pm-2am. Common, Edge Street (0161 832 9245). Free before 10pm, £2 after.              So Flute:  Teaming up with Rag Tag to put on a set from the much-revered DJ Spinna, with support from Danuka, Bolts, Baloo and Yadava.Saturday 14 June, 11pm-4am. Dry Live, Oldham Street (0161 236 9840). £6/£9/£12. Hit & Run : Another Ghosts of Garage party, this time with a return to Manchester from veteran Grant Nelson, aka Bump N Flex, who will be performing an extended classics set. Support comes from Dom Hz, Ardstepz and Rich Reason with hosting by Thruthos Mufasa and Chuckz.Friday 13 June, 10pm-3am. Antwerp Mansion, Rusholme Grove, Wilmslow Road (07429 578 193). Tickets £2.50/£5.50/£7.50. Groove in the Deep:  Deep and soulful house, minimal techno and all the shades in between are on order at this new night which aims to create unique clubbing experience in intimate spaces.Saturday 14 June, 11pm-4am. Sound Control, New Wakefield Street (0161 236 0340). Tickets £6.Haxan:  Michael Holland is back for another trawl through the radiophonic disco and film score techno crates with special guests.Sunday 15 June, 4pm-midnight, Common, Edge Street (0161 832 9245). Free. MusicDelilah:  Paris-born, London-raised Delilah   has recently enjoyed a boost in profile thanks to Prince; the purple-clad superstar inviting her on tour after he stumbled across her videos on YouTube. It’s no wonder he was so smitten: the 23-year-old is blessed with a stunning, soul-tinged voice which she marries to catchy, club-edged pop songs. She’s heading to Salford’s Islington Mill to preview tracks from her forthcoming second album, alongside material from 2012 debut LP, From the Roots Up.Tuesday 17 June, 7pm. Islington Mill, James Street, Salford (0161 278 6404). Tickets £20.\n\n\nJurassic 5\n\n\nJurassic 5 : It's been over six years after the seminal hip-hop group Jurassic 5 parted ways. After reuniting and storming the stage at Coachella in 2013, the boys are finally back for a UK tour, bringing their laid back daisy age-style hip-hop to Manchester Academy.Thursday 19 June, 7pm. Manchester Academy 1, Oxford Road (0161 275 2930). Tickets £25.Edwyn Collins : British pop music owes a lot to Mr Edwyn Collins who, as the  co-founder of Glaswegian band Orange Juice in the 1980s, basically invented jangle-pop, influencing everyone from The Smiths to Franz Ferdinand in the process. In recent years, he’s battled several strokes and MRSA, showing tremendous inner resolve to come back with several new albums – the latest being 2013’s Understated – that rank alongside his best ever work. We’re lucky to have him around, so don’t miss out on his latest visit to the Deaf Institute.Monday 16 June, 7.30pm. The Deaf Institute, Grosvenor Street (0161 276 9350). Tickets £18.Young British Artists : Salford’s First Chop Brewing Arm is fast becoming the go-to place for the region’s finest underground talent – as proven by this latest visit from the awesome Young British Artists. The Manc four-piece have been touting their noisy yet melodic shoegaze sound for a good few years, and now they’ve finally gotten round to making a debut album, A Change By Any Other Name. Check them out at this weekend’s launch party, joined by support bands Weird Era and Horrid.Saturday 14 June, 7.30pm. First Chop Brewing Arm, Unit 3, Trinity Row, Trinity Way (07970 241398). Tickets £7. This Feeling:  The Cool Britannia-inspired clubnight returns, shining the spotlight on another bunch of impressive local upstarts. Tonight’s line-up has singer-songwriter Jake Evans in the headline slot, plus Sly Digs and The Relays.Friday 13 June, 7.30pm. The Ruby Lounge, High Street (0161 834 1392). Tickets £5. \n\n\nThe Watchmakers\n\n\nThe Watchmakers:  Featured in CityLife’s One to Watch section a few weeks back, four-piece The Watchmakers are Manc music’s latest – and most joyously sky-scraping – addition to the city’s ever-growing psych bands scene. Tonight’s gig will see the boys launching their debut vinyl release, Illumination/Carpe Diem, joined by a stellar supporting line-up of Blossoms, Randolph Swain & The Red Lights, and Interstellar Overdrive DJs.Friday 13 June, 7.30pm. Night & Day Cafe, Oldham Street (0161 236 1822). Tickets £5.F*cked Up:  Cultish, noisy and thrillingly subversive, the progressive post-hardcore crew from Toronto preview their latest album Glass Boys. They’re always well worth catching live, thanks largely to the energetic, crowd-surfing antics of front-man Damian Abraham.Sunday 15 June, 7.30pm. Gorilla, Whitworth Street West (0161 407 0301). Tickets £15.ComedyThe Best in Stand Up:  Doing exactly what it says on the tin, Comedy Store’s flagship night unleashes stand-up from Ola, Markus Birdman, Stu Goldsmith and MC Mandy Knight.Friday 13 June 8pm/Saturday 14 June, 7pm & 9.30pm. The Comedy Store, Deansgate Locks (0161 839 9595). Friday £18, concs £12/Saturday £20, concs £14. Click here for tickets .XS Malarkey:  Talented young stand-up  Joe Lycett  (who's been popping up on TV a lot recently) gives us a sneak preview of his Edinburgh show; plus support from Che Burnley, Vince Atta and MC Toby Hadoke.Tuesday 17 June, 7.30pm .  The Pub/Zoo, Grosvenor Street (0161 273 1471). Tickets £5/£3 members. \n\n\nComedian Abandoman aka Rob Broderick\n\n\n    Abandoman - Moonrock Boombox: This Irish comedy hip-hop outfit stormed last year’s Edinburgh Fringe and it’s not hard to see why: the group create off-the-cuff raps, songs and word-bending genius from a handful of audience suggestions and no two shows are ever the same. Musical improv at its finest.Sunday 8pm. The Lowry, Pier 8, Salford Quays (0843 208 6000). Tickets £15.Mirth Lab: After a hugely successful launch night last month, Mirth Lab returns to The King’s Arms for another chaotic evening of stand-up, comedy sketches and open mic.Tuesday 17 June 8pm. The King's Arms, Bloom Street, Salford (0161 832 3605). Free.Tiernan Douieb and Keith Farnan: A double bill of comedy delights featuring political stand-up from Fresh Meat star Tiernan Douieb and activist comedian Chris Coltrane.Wednesday 18 June, 8pm. The Lowry (0843 208 6000). Tickets £10.Third Thursday Comedy Club: Start your weekend early with a trip to this stellar Prestwich comedy club, this month featuring filthy songstress Vikki Stone and Brummie charmer Joe Lycett.Thursday 19 June, 7.30pm. Longfield Suite, Longfield Centre, Prestwich (0161 253 7227). Tickets £8.\n\n\nJanice Connelly as Barbara Nice\n\n\nScottie Road the Musical and Barbara Nice: Writers/performers Gillian Hardie and Keddy Sutton are the brains behind Scottie Road, a bawdy comedy cabaret which has enjoyed two hit runs in Liverpool. The duo are now bringing the show to Manchester in this superb double-bill which also includes Janice Connelly as her loveable character creation Mrs Barbara Nice.Friday 13 June, 8pm. The Dancehouse, Oxford Road (0161 237 9753). Tickets £8.Indie Comedy Allstars: The Dead Cat Comedy empire grows ever larger with this excellent new night of free stand-up at Northern Quarter’s Walrus. Showcasing the best alternative comedians on the circuit, tonight’s session features Red Redmond, Lewis Charlesworth, Freddy Quinne and Jonathan Mayor.Sunday 15 June, 8pm. Walrus, High Street (0161 828 8700). Free.ClassicalLondon Concertante - Bach's Brandenburg Concertos: The world famous chamber ensemble arrives at Manchester Cathedral to perform Bach's magnificent Brandenburg Concertos (Numbers 3, 4, 5, and 6), joined by violin soloist, Anna-Liisa Bezrodny.Friday 13 June, 7.30pm. Manchester Cathedral, Victoria Street (0161 833 2220). £16-£28\n\n\nThe Zelkova Quartet\n\n\nZelkova Quartet: A welcome return from the award-winning string ensemble, tonight performing music by Bartok, Beethoven and Brahms.Friday 13 June, 7.30pm. Royal Northern College Of Music, Oxford Road (0161 907 5555). Tickets £10.Manchester Chamber Choir: Music of a celestial theme as the Manchester Chamber Choir stages its big summer concert, conducted by Justin Doyle.Saturday 14 June, 7.30pm. Church of the Holy Name of Jesus, Oxford Road (0161 273 1456). £10/£8 concs.Chains Like The Sea – The Music Of Bernard Rands: Immerse yourself in the music of Chicago-based, Sheffield-born composer Bernard Rands in this two-day festival organised by the RNCM and BBC Philharmonic. Highlights include his brilliant Cello Concerto played by Johannes Moser (Wednesday 18 June, 7.30pm, MediaCityUK), the RNCM Wind Orchestra and New Ensemble performing a number of world premiere works (Tuesday 17 June, 8pm, RNCM), and the great man himself in a special In Conversation event with festival director Clark Rundell (Tuesday 17 June, 6.30pm, RNCM).Tuesday 17 - Wednesday 18 June. Full schedule and ticket information .Foden’s Band: For this final stage of Foden’s newly launched Composers Competition, the band performs five selected works in front of an adjudication panel, as well as a non-competition repertoire.Sunday 15 June, 7.15pm. Royal Northern College Of Music, Oxford Road (0161 907 5555). Tickets £5.Theatre\n\n\nThe Two Worlds of Charlie F\n\n\n             The Two Worlds of Charlie F: Last chance to see Owen Sheers’ acclaimed and unflinching play telling the soldier’s perspective of war. Exploring the consequences of injury, both physical and psychological, the play’s cast includes serving and veteran servicemen and women, and all profits from the tour will help fund The Royal British Legion's theatre welfare programme. Our reviewer Natalie Anglesey gave it five stars and described it as a 'personal and very moving look at the effects of war on individuals'.Friday 13 June, 7.30pm/Saturday 14 June, 2.30pm & 7.30pm. Opera House, Quay Street (0844 847 2275). Tickets £15.90-£30.40.An August Bank Holiday Lark: The wonderful Northern Broadsides come up trumps yet again with this new touring production marking the centenary of the First World War. Written by regular Broadsides collaborator Deborah McAndrew, the play explores the impact of the First World War on a small rural community in East Lancashire, a poignant trip into the hearts and minds of 100 years ago.Friday 13 June, 7.30pm/Saturday 14 June, 2.30pm & 7.30pm. Coliseum Theatre, Fairbottom Street, Oldham (0161 624 2829). Tickets £12.50-£18.50.Love Story: Stephen Clark's adaptation of Erich Segal's novel about two very different people who fall in love. A theatrical tear-jerker of the highest order, the production – embarking on its first tour outside of the West End – will feature a new score written by the venerable Howard Goodall CBE.Thursday 19 June, 7.30pm, ends July 12. Octagon Theatre, Howell Croft South, Bolton (01204 520661). Tickets £9-£24.Pardoner's Tale: Accompanied by a live score of music, songs and intriguing sound effects created from everyday objects, Tangere Arts bring their honest charm and brilliant wit to Chaucer's 700-year-old tale. For ages 7 plus. Wednesday 18 June, 7pm/Thursday 19 June, 11am & 1.30pm, ends June 28. Royal Exchange Theatre, St Ann's Square (0161 833 9833). Tickets £12/£10 concs.\n\n\nDerren Brown\n\n\nDerren Brown: Infamous: 'Psychological illusionist' and disarmingly likable telly personality Derren Brown brings his latest one-man show to The Lowry for a week-long run. Tickets are sure to sell like hot cakes, so book early to avoid disappointment.Friday 13/Saturday 14 June, 7.30pm, ends June 21. The Lowry, Pier 8, Salford Quays (0843 208 6000). Tickets £34-£52.Killing Roger: Award-winning company Sparkle & Dark use puppetry and live music to document the touching friendship between an opinionated teenager and a chain-smoking old man.Friday 13 June, 8pm. The Lowry, Pier 8, Salford Quays (0843 208 6000). Tickets £12.Blackbird: Stickleback Theatre revives David Harrower's Olivier-winning drama about a woman driven to confront the man she had an affair with when he was 41 and she was 12. A typically thought-provoking choice of work from the award-winning Cheshire-based company, the production features two electrifying performances from its leads Chris Saunders and Sian Weedon.Thursday 19 June, 8pm. The Lowry, Pier 8, Salford Quays (0843 208 6000). Tickets £12.The Flare Weekender 2014: Making a welcome return to Hulme’s Z-arts, The Flare Weekender 2014 offers a glimpse of where the cutting edge of theatre might be heading in the future, with artists from Amsterdam, Barcelona, Bergen, Bristol, London and, of course, good old Manchester. Spread across two days, the jam-packed theatre programme is also accompanied by live music, an artist’s forum, interactive workshops and a big closing party.Friday 13 June, 7pm/Saturday 14 June, 1pm & 7pm.  Z-arts, Stretford Road, Hulme (0161 226 1912). Day pass £10/£6 concs, weekender pass £16/£10 concs. Click here for tickets .Arts\n\n\nBarnaby Festival\n\n\nBarnaby Festival 2014 : The beautiful and historic Charles Roe House open its doors for a number of cracking exhibitions at this month’s Barnaby Festival. Starting on Saturday and running for the next two weeks, the bumper arts programme includes a show by Macclesfield collective ArtsXstra, an animation by international artist Rachel Goodyear and ‘Ugly Macc’ images by aspiring photojournalist Martin Needham.Starts Saturday 14 June, runs until June 29. Charles Roe House, Chestergate, Macclesfield. Many events free. Click here for a full exhibition programme.Paper Pop-Up Gallery:  Another highlight of Macclesfield’s Barnaby Festival, Manchester’s Paper Gallery will be transforming an empty unit in the Grosvenor Shopping Centre into a pop-up art gallery with an exhibition of works based around an ‘industry’ theme. Some of the two dozen Paper artists will be featuring alongside invited artists and making paper-based works in response to the theme.Wed-Sun 11am-4pm, starts Saturday 14 June, runs until June 29. Grosvenor Shopping Centre, Market Place, Macclesfield. Free.Amanda Whewell: Unmade in England:  An exhibition by local artist Amanda Whewell who makes and re-makes work from pre-used textiles, deconstructing and reconstructing to create evolving artworks. Whewell will also be running free workshops inspired by her exhibition on 21/22/28/29 June.           Open every Fri-Sun 11am-4pm, until July 5. Bankley Studios and Gallery, Bankley Street, Levenshulme (0161 374 2204).We Made This Exhibition: Marvel at the cream of Spanish design in this new exhibition centred around WeMadeThis.Es – a book project highlighting Spanish excellence in post-digital disciplines, from graphic design to motion design and typography to visual identity. The book will be presented as part of an exhibition showcasing some of the daring artworks of Spanish artists including Alex Trochut, Brosmind, Hey Studio, Marta Cerda, Losiento and more.Tue/Wed/Thu 4pm-midnight/Fri/Sat 4pm-3am, runs until July 5. Twenty Twenty Two, Dale Street (0161 237 9360).Tigers, Caterpillars and Other Wild Things: Children's Books In The 1960s: An exhibition of much-loved characters and stories from children's books of the 1960s selected from the collections held at Manchester Metropolitan University Special Collections.Mon-Fri 10am-4pm, starts Monday 16 June, runs until September 5. All Saints Campus, Grosvenor Square (0161 247 2000). Free.\n\n\nJoel Goodman\n\n\nImperial War Museum North\n\n\nReactions14 :  The Sleeping Green Between by Jennifer Vickers : Imperial War Museum North’s Reactions14 series – marking the centenary of the First World War - continues with this stunning installation from textile artist Jennifer Vickers. Inspired by the Red Cross quilts which were made to raise funds to support the war effort, Vickers has produced this intricate textile artwork consisting of 179 crosses to represent the war graves at the R.E. Farm cemetery, Belgium, where her great grandfather is buried.Open daily 10am-5pm, starts Saturday 14 June, runs until September 21. Imperial War Museum North, The Quays, Trafford Wharf Road (0161 836 4000). Free.Manchester School Of Art Degree Show: With another academic year over, it’s time to marvel at the wondrous talent and creativity of final year students at Manchester School of Art. The perfect opportunity to see the next generation of artists and designers, the show features a diverse range of work including fine art, fashion, graphic design, illustration, filmmaking, textiles and much more.Mon-Fri 10am-6pm/Sat/Sun 10am-4pm, starts Saturday 14 June, runs until June 25. All Saints Campus, Higher Ormond Street (0161 247 1751). Free.Open For Business: A major touring photographic exhibition which reveals the untold story of British manufacturing and industry through the lens of some of the world's greatest photographers, including Martin Parr, Mark Power, Chris Steele-Perkins and Alessandra Sanguinetti.Open daily 10am-5pm, runs until August 3. Museum of Science and Industry, Liverpool Road, Castlefield (0161 832 2244). Free.\n",
        "title": "What's on in Greater Manchester this week: 12 June - 18 June",
        "date": "11-06-2014",
        "link": "http://www.manchestereveningnews.co.uk/whats-on/whats-greater-manchester-week-12-7250661"
    },
    {
        "article": "\n\nThe B2B division of Manchester agency RMS PR has been boosted by two senior appointments.   Richard Knowles, formerly of Midlands agency, Connect PR, joins RMS as account director in the Business and Professional Services team. A former journalist, Knowles has 12 years’ PR and in-house communications experience and has worked on a number of blue chip client accounts, including Volkswagen UK, WD-40, Renault and Suzuki.Kate Galloway has also arrived to direct the property, construction and financial teams.  An ex-broadcast journalist, Galloway has 11 years’ agency experience and joins RMS PR from Newcastle brand communications agency Gardiner Richardson, where she advised B2B and B2C clients in the health, housing, legal, financial, tourism and education sectors.RMS PR managing director, Ruth Shearn, said: “Attracting PR professionals of the calibre of Kate and Richard demonstrates the direction RMS PR is heading and we fully expect to be welcoming even more recruits in the near future as we continue to add to our client roster.”   Manchester\nagency, Refresh PR, has been appointed by British trade association BEAMA Underfloor Heating to promote a new national campaign which encourages homeowners to fit underfloor heating in their homes.            \nThe independent consumer campaign, ‘Ask For Underfloor’, will target homeowners who are renovating or updating their home to help them understand the benefits of underfloor heating, as well as housebuilders to encourage them to specify underfloor heating in new builds.\nDirector of Refresh PR, Laura Mashiter, said: “As the housing market begins to pick up, now is the time to increase communications with those who are looking to upgrade, improve and move home. “\n\n\n\nManchester\nbased post-production company, 422.tv, has teamed up with Artnoire Creative Services and The North West Film Archive to produce a DVD entitled Life on the Homefront in North West England. \nThe film, which includes previously unpublished footage, will be available to buy exclusively at Manchester Central Library and IWM North.\nLaunched to mark the centenary of the First World World, the 65 minute documentary presents a evocative picture of what life was like for people in the region during World War 1. Drawing on unseen archive footage, the film features the Accrington Pals, the Lancashire Fusiliers and the Cheshire Regiment as they prepare for active service on the Western Front.\n422.tv provided all post production and design services for the documentary. Damien Lynch, facilities director at 422.tv, said ‘This is the second time we have partnered with Artnoire and the NWFA on this kind of project. It was fascinating to work with such rare, and mostly unseen footage, and to gain an insight into life in the North West of England during the great war.”\n\nManchester\nfirm PH Media Group has marked the first birthday of its charity, the PHMG Foundation, by setting a fundraising target of £16,000 for 2014. \nAfter surpassing £12,000 last year, staff have already kick-started this year’s campaign by taking part in a series of events, including the Stroke Association’s third annual Resolution Run, and ae planning to climb Mount Snowdon.\nThe PHMG Foundation has also recently been recognised for its support of the Christie Hospital by earning a spot on the acknowledgement board at the new young oncology unit.\n\nTangerine\nPR has collected two Certificates of Excellence at The EMEA SABRE Awards, which recognises best practice PR on an international scale. \nThe awards attract entries from some of the largest and most established PR consultancies in Europe, the Middle East and Africa, and were announced at a conference and dinner.\nThe Certificates of Excellence reward Tangerine’s Juice Academy and its Freshly Squeezed programme, and looked at every aspect of Tangerine’s training and development of its 58-strong team.\n\nSchool\nimprovement programme The Success for All Foundation UK  has appointed Reform Creative for a re-brand. \nThe work will include modernising the brand, unifying the products, improving consistency of the brand and creating an individual identity for each of the programmes and increasing awareness of SFA brand among its target audience.\nReform will also establish the best way of communicating the brand and the brand identity. Gary Devreede, senior designer, said, “We wanted to create a brand that was perceived as trustworthy, honest and friendly.”\n",
        "title": "Media news in brief",
        "date": "11-06-2014",
        "link": "http://www.manchestereveningnews.co.uk/business/media/media-news-in-brief-7249809"
    },
    {
        "article": "\nThey are the faces of ordinary men and women who lived and died in the world’s bloodiest war.Now the story of how the people in the north west faced up to the Great War has been dramatically re-told using rare film footage.Archivists have pieced together century-old films to create a new DVD showing what life was like on the ‘home front’ during the devastating conflict.The unique documentary-style movie, launched to mark the centenary of the war, has been produced by the North West Film Archive and is narrated by actress Maxine Peake.Producers say the film, which enjoyed a city centre premiere last week, is a ‘powerful testament’ to local people and the losses they endured during the conflict.Marion Hewitt, director of the archive, said: “We are very pleased to have been able to save so much of this rare and unique footage for the region.\n\n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n “Releasing it on DVD at the beginning of the period of First World War commemorations means that it will be available early for schools to include in classroom activities and for people to appreciate the enormity of the sacrifices made by so many.”The North West Film Archive was established at what became Manchester Metropolitan University in 1977 and recently decamped to the revamped Manchester Central Library.The archive contains rare and fragile footage from the Great War.The new DVD paints a vivid picture of the region at war, including troops training in trenches near Bury and others being inspected on parade in Bolton.It shows members of the ill-fated Accrington Pals Battalion, which was decimated at the Battle of the Somme, and the Lancashire Fusiliers, who famously earned six Victoria Crosses before breakfast at Gallipoli.It also shows wounded soldiers at Altrincham War Hospital and dozens of other clips including scenes from peace pageants in Saddleworth, Altrincham and Macclesfield.A spokesman for the archive said: “This rare archive footage is a powerful testament to the lives of people on the home front, and the losses and changes they endured a century ago.”The film’s premiere took place last Wednesday at the Dancehouse Theatre on Oxford Road, in the city centre, when it was also released for sale to the public. \n",
        "title": "New film features rare footage showing how the North West faced the Great War",
        "date": "31-05-2014",
        "link": "http://www.manchestereveningnews.co.uk/news/greater-manchester-news/world-war-one-new-film-7194243"
    },
    {
        "article": "\nTrafford is the subject of our latest gallery of remarkable pre and post-war aerial photos of the city and its neighbouring towns.The Britain from Above website features images from the Aerofilms collection, a unique aerial photographic archive of international importance.The collection includes 1.26 million negatives and more than 2,000 photograph albums.We're ringing you a selection of the hundreds of images taken over what is now Greater Manchester between 1919 and 1949 - continuing with this wonderful collection showing how north Manchester used to look from the skies.\n\n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n Dating from 1919 to 2006, the total collection presents an unparalleled picture of the changing face of Britain in the 20th century.READ: 30 fascinating aerial pictures of north Manchester from the 1920s, 30s and 40sREAD: 30 fascinating aerial pictures of Manchester city centre from the 1920s, 30s and 40sREAD: In pictures: Historical images show how Curry Mile in Rusholme used to lookREAD: In pictures: Manchester Central Library through the yearsREAD: Down the decades: See how Deansgate has changed over 100 years\n",
        "title": "30 fascinating aerial pictures of Trafford from the 1920s, 30s and 40s",
        "date": "15-05-2014",
        "link": "http://www.manchestereveningnews.co.uk/news/nostalgia/trafford-air-30-fascinating-aerial-6935079"
    },
    {
        "article": "\nEventsIn Conversation: Helen Simpson And Ben Masters: A meeting of great literary minds as short story writer Helen Simpson and novelist Ben Masters join forces for this latest In Conversation event at the Burgess Foundation.  Monday 31 March, 6.30pm. International Anthony Burgess Foundation, Chorlton Mill, Cambridge Street . £23.50.\n\n\nIan West/PA Wire\n\n\nBoy George arriving for the 2014 Brit Awards\n\n\n Klaxons: Dig out the glowsticks and party like it’s 2007 – as those former torchbearers of ‘nu-rave’, Klaxons, make their long-awaited return. Incredibly, it’s been a full seven years since the group scaled the charts with terrific rave-pop anthems such as Atlantis to Interzone and Golden Skans. Hopefully reclaiming those former glories, the boys are off on a tour of small UK venues in support of their forthcoming album, Love Frequency. Thursday 3 April, 7.30pm. The Ruby Lounge, High Street (0161 834 1392). £12.Manic Street Preachers: These Welsh rock giants have been working overtime this past year, recording two new albums in quick succession. The first, Rewind The Film, came out at the end of 2013, and its follow-up, Futurology, is due in May. Expect to hear material from both at tonight’s O2 Apollo gig, alongside moshpit-friendly hits like A Design for Life and Motorcycle Emptiness. Tuesday 1 March, 7pm. O2 Apollo, Stockport Road, Ardwick Green (0161 273 6921). £34. Click here for tickets to Manic Street PreachersTokyo Police Club: Hailing from Ontario, Canada, and not the Far Fast, guitar quartet Tokyo Police Club play peppy pop songs with a punk undertone. After a lengthy four year hiatus, they’re back this month with their fourth album, the excellent Forcefield. Sunday 30 March, 7.30pm. The Ruby Lounge, High Street (0161 834 1392). £11.Temple Songs: Not to be confused with Temples (they probably get well annoyed with that), Manchester four-piece Temple Songs make ’60s-saluting psych-pop that channels the Beach Boys through a fuzzy, lo-fi filter. Make sure you get down early for tonight’s mind-blowing supporting line-up which includes More Trees Please, Warm Widow and Young British Artists. Saturday 29 March, 8pm. Night and Day Cafe, Oldham Street (0161 236 4597). £5. Click here for tickets to Temple SongsGoldheart Assembly: Celebrating the vinyl re-release of their 2010 debut album Wolves and Thieves, London six-piece Goldheart Assembly will be playing the whole of their Americana-infused classic from start to finish. Support comes from two stellar Manc music talents: alt-country exponents The Cornelius Crane and husband-wife psych-folk duo Bird to Beast. Wednesday 2 April, 7.30pm. The Ruby Lounge, High Street (0161 834 1392). £8.ClassicalOrfeo Ed Euridice: Gluck's take on the Orpheus myth is presented in a concert performance by RNCM Opera Orchestra and Chorus under Roger Hamilton, with Heather Lowe (Orfeo), Joanna Norman (Euridice) and Catriona Hewitson (Amore). Friday 28 March, 7.30pm. Manchester Cathedral, Victoria Street (0161 833 2220). £20. Click here for tickets to Orfeo Ed EuridicePacifica Quartet: The wonderful Illinois-hailing chamber group performs Haydn's String Quartet In B Flat 'Sunrise', Britten's String Quartet No 2 In C and Brahms's String Quartet In C Minor. Monday 31 March, 7.30pm. Royal Northern College of Music, Oxford Road (0161 907 5200). £22.Fell Clarinet Quartet: A varied programme from the Manchester-based quartet, including early Hungarian dances, French composers Dubois and Desporte and pieces by George Gershwin. Saturday 29 March, 7.30pm. Heywood Civic Centre, Church Street, Heywood (030 0303 8399). £14.Manchester Beethoven Orchestra: A springtime-themed concert in which the MBO performs Dvorak’s Symphony No. 8, Strauss’ Overture Die Fledermaus, Borodin’s In the Steppes of Central Asia by Borodin and Bruch’s Scottish Fantasy. Frank Lennon conducts, with soloist Siobhan Doyle on violin. Sunday 30 March, 7.30pm. Gorton Monastery, Gorton Lane (0161 223 3211). £10.FutureEverything 2014: RNCM have teamed up with FutureEverything to bring us five days of stunning live performances and installations. CityLife picks include German sound artist Robert Henke’s new audio-visual project, Lumiere (Friday 28 March, 8pm); Longplayer, the computer generated musical creation from Jem Finer designed to play for 1000 years (Saturday 29 March, 7pm); and Tim Hecker, the celebrated Montreal-based ambient electronic musician and sound artist (Tuesday 1 April, 7.30pm). Friday 28 March to Tuesday 1 April. Royal Northern College of Music, Oxford Road (0161 907 5200). For full programme at click hereComedyXS Malarkey: Another belting line-up at the Manchester comedy institution, with multimedia comic and Foster's Best Newcomer nominee David Trent topping the bill. Support from Phil Ellis, Lee Grounds and Katy Truelove. Tuesday 1 April, 7.30pm. The Pub/Zoo, Grosvenor Street (pubzoomanchester.co.uk/0161 273 1471). £5/£3 members.Group Therapy: The Group Therapy team can seemingly do no wrong, banging out top-notch bills every time. Headlining tonight is king of the one-liner, Mr Gary Delaney, ably supported by Gary Little and Danny McLoughlin. Saturday 29 March, 7pm. Gorilla, Whitworth Street West (0161 407 0301). £10/£8 concs. Click here for tickets to Group TherapyThe Best in Stand Up: Near the knuckle stand-up, intelligent gags and insightful one-liners from Josh Howie. Also featuring Justin Moorhouse and David Hadingham. Friday 28 March, 8pm/Saturday 29 March, 7pm & 9.30pm. The Comedy Store, Deansgate Locks (0161 839 9595). Friday £18, concs £12/Saturday £20, concs £14. Click here for tickets to The Best in Stand UpRichard Herring: We're All Going To Die: Sharp and intelligent satire about the inevitability of death from the prolific podcaster and Stewart Lee's former comedy partner. The subject sounds depressing, but worry not: Herring's an expert stand-up, crafting exquisite jokes from even the darkest of subjects. Friday 28 March, 8pm. The Lowry, Pier 8, Salford Quays (0843 208 6000). £16.Mark Thomas: 100 Acts Of Minor Dissent: Anarchic and satirical humour as the stand-up and political activist catalogues his attempts to make 100 actions of mischief in one year, encouraging audiences to join him on his impish crusade. Friday 28 March, 8pm. Albert Halls, Victoria Square, Bolton (01204 334400). £15/£10 concs.Laughing Cows: The Laughing Cows team make their monthly sojourn to Glossop, this time unleashing the talents of Nina Gilligan, Theresa Farlow, Mel Medford, Ellen Tomlinson and MC Kerry Leigh. Saturday 29 March, 8pm. The Globe Inn, High Street West, Glossop (01457 852417). £7.Mitch Benn Is The 37th Beatle: The musical satirist and Radio 4 regular explores his own comical connections to the Beatle story, performing new sketches and a selection of his best pieces. Sunday 30 March, 8pm. The Lowry, as above. £14/£12 concs.Sh*ts & Giggles Comedy Night: Antwerp Mansion’s monthly comedy session continues to impress with its sterling choice of headliners: topping the bill tonight is loveable Teesider Patrick Monahan, plus support from potty-mouthed Lancashire lass Lindsey Davies and circuit fave Red Redmond. Sunday 30 March, 7.30pm. Antwerp Mansion, Kent Road West, Rusholme (07809 444950). £5. Click here for tickets to Sh*ts & GigglesLee Hurst: Things That Make You Go Aaarggh!!!: The king of improv and ad lib comedy comes to Salford Quays with his latest stand-up show, exploring all the things that make you go ‘arrghhhh!’. Sunday 30 March, 8pm. The Lowry, as above. £16.\n\n        Video loading           \n\n Norman Lovett: Old And New: Best known for his role as Holly in Red Dwarf, legendary stand-up Norman Lovett is back on the road, bringing his charming brand of deadpan whimsy to The Dancehouse. Monday 31 March, 7.15pm. The Dancehouse, Oxford Road (0161 237 9753). £10. Click here for tickets to Norman LovettTheatrePeter Pan on Ice: J.M. Barrie's classic tale of never growing up is brought to the rink in a family show of flying acts, acrobatics, figure skating and comedy moments by the Russian Ice Stars. Friday 28 March/Saturday 29 March, 2.30pm & 7.30pm/Sunday 30 March, 2.30pm. £26.90-£28.90. Palace Theatre, Oxford Street (0844 847 2275). Click here for tickets to Peter Pan on IceJulie Madly Deeply: West End performer and star of Fascinating Aida, Sarah Louise Young, pays affectionate homage to Oscar-winning actress and singer Julie Andrews through words and song. Monday 31 March, 8pm. £14/£12 concs. The Lowry, Pier 8, Salford Quays (0843 208 6000).Entertaining Mr Sloane: Joe Orton's darkly comic four-hander about a sister and brother vying for the favours of a desirable stud (under the eyes of their ancient dadda) receives a welcome revival courtesy of London Classic Theatre Company. Tuesday 1 April, 7.30pm/Wednesday 2 April, 2.30pm & 7.30pm/Thursday 3 April, 7.30pm, ends April 5. £10.50-£18.50. Oldham Coliseum Theatre, Fairbottom Street, Oldham (0161 624 2829). Click here for tickets to Entertaining Mr SloaneRefugee Boy: Poet Benjamin Zephaniah's heartbreaking teen novel is adapted for the stage by Manchester’s very own Lemn Sissay. Its plot follows 14-year-old Alem whose mother and father decide to leave him in London after a holiday because their home country is being ravaged by a violent civil war. Tuesday 1 April, 7.30pm/Wednesday 2 April/Thursday 3 April, 7pm. £9-£15. Waterside Arts Centre, Waterside Plaza, Sale (0161 912 5616). Click here for tickets to Refugee BoyGym Party: Advance notice for next weekend’s arrival of the always excellent theatre company Made In China, performing their latest offering Gym Party at Royal Exchange. Exploring and dissecting the nature of competition, the plays features three actors competing for the audience’s affection and points in a weird, Big Brother-style warped gameshow. Friday 4 April, 7.30pm/Saturday 5 April, 8pm. £12 & £10. Royal Exchange Theatre, St Ann’s Square (0161 833 9833).Kindertransport: Last chance to see this stunning touring production marking the 75th anniversary of Kindertransport – an initiative which, nine months before the outbreak of WWII, ferried 10,000 mainly Jewish children from Austria and Germany to safety. Diane Samuels' play looks at the relationship between mothers and daughters with the backdrop of this event that meant many would never see their parents again. Friday 28 March, 7.30pm/Saturday 29 March, 2.30pm & 7.30pm. £11.90-£32.40. Opera House, Quay Street (0844 847 2275). Click here for tickets to Kindertransport\n\n\nRobert Day\n\n\nGabrielle Dempsey plays Eva in Kindertransport running at the Yvonne Arnaud Theatre, Guildford March 3 to 8\n\n\n Warnings To The Curious: The Ghost Stories Of Mr James: A one-man show of adaptations of Montague Rhodes James' ghost stories of the 20th century staged by Don't Go into the Cellar! in Victoriana style. Friday 4 April, 7.30pm. £10/£7 concs. The Edge Theatre & Arts Centre, Manchester Road, Chorlton (0161 282 9776).A Day Of Pleasure: Useful Donkey Company presents an adaptation of Nobel prize-winning writer Isaac Bashevis Singer's collection of short stories for children about growing up in Warsaw. Starring Stuart Richman as the author. Friday 28 March, 7.30pm. £10/£8 concs. Z-arts, Stretford Road, Hulme (0161 226 1912).ArtsAlbert Square:Big Digital Project Lights Up: A free, family-friendly sound and light show on Manchester Town Hall and Lloyd Street performed and created by local people, celebrating the imagination and creativity of Greater Manchester. Part of FutureEverything 2014 and Manchester Histories festival. Saturday 29 March, 7.30pm-9pm. Albert Square. More info hereThe Quays:Future City Festival: Ray Lee: Chorus: The second commission for Future City Festival – a celebration of the architecture and space of the Salford Quays and MediaCity areas through conceptual and wow-making art installations – is by Oxford sound artist Ray Lee. A British Composer of the Year winner in 2012, Lee will be presenting Chorus, a huge installation of giant kinetic sculptures that creates a celestial choir of spinning sound machines. Starts Thursday 3 April, from dusk, runs until April 5. Salford Quays. More info at hereCentral Art Gallery:Conflict and Consequence: Students from Ashton Sixth Form College have explored the consequences of war and conflict in this timely exhibition to coincide with the Centenary of World War One. This is a chance to see their responses alongside works and objects from the collections held by Tameside Museums and Galleries Service. Tue/Wed/Fri 10am-12.30pm & 1pm-4pm/Thu 1pm-7pm/Sat 10am-7pm, runs until July 5. Old Street, Ashton-under-Lyne (0161 342 2650).Manchester Art Gallery & Central LibraryDan Dubowitz and Alan Ward: Citizen Manchester: Learn more about Manchester Central Library’s epic four-year redevelopment, as artists Dan Dubowitz and Alan Ward present 40 works developed from research into the city archives, photographs and recorded tales. The artworks – which are embedded within the fabric of Manchester Art Gallery and Central Library - provide insights into the relationships between a city, its citizens and place, revealing how the refurbishment of a building can go far beyond physical refurbishment. Runs until June 22. Manchester Art Gallery, Mosley Street, open daily 10am-5pm/late Thursday 9pm (manchestergalleries.org/0161 235 8888) / Central Library, St Peters Square, Mon-Thu 9am-8pm/Fri/Sat 9am-5pm (manchester.gov.uk/centrallibrary/0161 234 1966).\n\n\n\n\n\n\n\nVIEW GALLERY\n\n\n\n\n\n Bureau:Robin Megannity: Compression: A first solo exhibition from Burnley-born, Manchester-based artist Robin Megannity, whose ambiguous oil paintings draw on art historical references as well as traditional and academic techniques. Mon-Fri 8am-6pm, runs until April 18. Hardman Square, Spinningfields (07757 956555).Touchstones:Four Seasons In One Day: This exhibition from the borough's art collection explores the four seasons through a range of historic and contemporary works of art. Springtime blossom, summer sunshine, autumn leaves and winter snows are all captured in work from a range of artists including Adrian Berg, Joseph Farquharson, Fred Jackson and Edward Stott. Tue-Sat 10am-5pm, runs until March 7, 2015. The Esplanade, Rochdale (01706 924492).Manchester Jewish Museum:Four Four Jew – Football, Fans and Faith: This punningly-titled new exhibition celebrates the contribution Jews have made to the world of football, on and off the field, and considers what football has given to British Jews. A Manchester focus will run throughout with displays about Manchester Maccabi, the Munich Air Disaster, Manchester City legend, Bert Trautmann and Manchester United director, Michael Edelson - the longest serving director of a Premiership club. Sun-Thu 10am-4pm/Fri 10am-1pm, runs until September 21. Cheetham Hill Road (0161 834 9879).Belle Vue Exhibition :Belle Vue: Showground of the World: Last chance to enjoy this fantastic Manchester Histories Festival highlight exploring the heady days of Belle Vue Zoological Gardens. Combining items from over six different collections, the exhibition aims to remember the days when Belle Vue was the country's centre of mass entertainment. Come and see the hand prints of Gracie Fields set in concrete, look at World speedway bikes and stand amazed at the life-size sculpture of Omi the tattooed man. Friday 28/Saturday 29/Sunday 30 March, 11am-6pm. Dale Street (0161 306 1982).The Lowry:Jonathan Yeo: Portraits: A huge retrospective of the celebrated British portrait artist, bringing together his most famous subjects including Helena Bonham Carter, Kevin Spacey, Michael Parkinson and Grayson Perry. Sat 10am-5pm/Sun-Fri 11am-5pm, runs until July 27. Pier 8, Salford Quays (0843 208 6000).\n\n\nMaxine Peake by Jonathan Yeo\n\n\n ClubbingRubix : The clubnight-formerly-known-as-Vice-but-for-legal-reasons-definitely-nothing-to-do-with-the-publication-of-the-same-name is back with special headline guests Metrodome and Kydro supplying their favourite cuts from the 80s. Friday 28 March, 10.15pm-3am. Antwerp Mansion, Kent Road West, Rusholme (07809 444950). £3/£5. Click here for tickets to RubixCherry: The predominant pop-emo bands of the mid-00s go head-to-head at this special edition of the clubnight, as the residents raid the back catalogues of Fall Out Boy and Panic At The Disco to definitively answer who is best (Panic, obvs). Friday 28 March, 11pm-3.30am. Sound Control, New Wakefield Street (0161 236 0340). £5. Click here for tickets to CherrySidewinder : A brand as big as Sidewinder celebrating an anniversary as big as its 15th deserves to do it in a venue that’s one of the biggest around. A huge line-up of more than 70 DJs and live acts (including Luck & Neat, PAYG Cartel, Lance Morgan, Jamie Duggan and Grooverider) will help the expected 7,000 guests celebrate in style. Saturday 29 March, 10pm-4am. Bowlers, Longbridge Road, Trafford Park (01706 299902). £18.Pop : The effervescent trio Dance Lady Dance preside over another dose of disco, electro and arms-aloft pop. Saturday 29 March, 10pm-4am. The Deaf Institute, Grosvenor Street (0161 276 9350). £3/£5. Click here for tickets to PopTurn It Out : The alt-rock, new wave, indie and hip-hop night is back once again with everything from Fugazi to Fleetwood Mac, Talking Heads to TV On The Radio and the Beastie Boys to The Bronx. Saturday 29 March, 11pm-3.30am. Kraak Gallery, Stevenson Square (07855 939 129). £2/£3. Click here for tickets to Turn It OutHoly Circus: It’s the last Friday of the month which means it must be time for another helping of indie, garage rock, lo-fi, reggae, disco and 60s tunes courtesy of the resident DJs. Friday 28 March, 11pm-4am. The Ruby Lounge, High Street (0161 834 1392). £4.Boombox : Every Friday, a night of 90s house beats, jams and rhythms from stalwart residents David Dunne and Andy Daniels. Friday 28 March, 4pm-2am. Twenty Twenty Two, Dale Street (0161 237 9360). Free.\n",
        "title": "What's on in Greater Manchester this week: March 27 - April 2",
        "date": "26-03-2014",
        "link": "http://www.manchestereveningnews.co.uk/whats-on/whats-on-news/whats-greater-manchester-week-march-6880686"
    }
]